{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_copy", 
      "name": "id", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar0", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0078125"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "relu0_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "relu0", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_relu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage1_unit1_relu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[12, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_sc", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[33, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[33, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn4", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[41, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_relu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage1_unit2_relu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[72, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[72, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn4", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[73, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_relu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage1_unit3_relu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0], [102, 0, 1], [103, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[104, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[104, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn4", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[105, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_relu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage2_unit1_relu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[115, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_sc", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 1], [142, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[136, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[136, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn4", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0], [150, 0, 0], [151, 0, 1], [152, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[144, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0], [157, 0, 1], [158, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_relu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage2_unit2_relu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0], [173, 0, 1], [174, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[175, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[175, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn4", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[180, 0, 0], [181, 0, 0], [182, 0, 0], [183, 0, 1], [184, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[176, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 1], [190, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 1], [197, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_relu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage2_unit3_relu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[202, 0, 0], [203, 0, 0], [204, 0, 0], [205, 0, 1], [206, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[207, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[207, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn4", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0], [215, 0, 1], [216, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[208, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "null", 
